Repository: LuisAlfredo92/Super-QOI-converter-Console-
Catalog: Messages.*.resx
Languages: es

# Not console necessary
source: It's not necessary to use this program with console commands, you can execute it by double-clicking on the executable file and you'll receive help to use it as an usual program. However, if you want to use it as console command, here's the necessary info:
es: No es necesario usar este programa con comandos de consola, puedes ejecutarlo haciendo doble clic en el archivo ejecutable y recibirás ayuda para usarlo como un programa común. Sin embargo, si quieres usarlo como comando de consola, aquí está la información necesaria:

# Specify console version
source: (console version)
es: (versión de consola)

source: Welcome to
es: Bienvenido a

# Commands title
source: Command: "Super QOI converter" [Paths to files or folders] [Options]
es: Comando: "Super QOI converter" [Rutas a archivos o carpetas] [Opciones]

# Copy attributes and dates option
source: -c Copy attributes and dates from original files
es: -c Copia los atributos y fechas de los archivos originales

# Delete source option
source: -d Delete original files when finishing
es: -d Elimina los archivos originales al terminar

# Ignore colors option
source: -i Ignore console colors
es: -i Ignora los colores de la consola

# Help option
source: -h, --help Shows help
es: -h, --help Muestra la ayuda

# You must add paths
source: You must add path files to use these options!
es: ¡Debes agregar rutas de archivo para usar estas opciones!

# More info how to execute
source: to get more info about how to execute this program by console parameters
es: para obtener más información de cómo ejecutar este programa con parámetros de consola

source: Type
es: Escribe

# Invalid option or path
source: Sorry, that is an invalid option or an invalid path (you must use absolute paths)
es: Lo siento, eso es una opción inválida o una ruta inválida (debes usar rutas absolutas)

# Not copy attributes and dates option
source: -nc Won't copy attributes and dates from original files and will skip the confirmation message
es: -nc No copiará los atributos y fechas de los archivos originales y omitirá el mensaje de confirmación

# Not delete source option
source: -nd Won't delete original files and will skip the confirmation message
es: -nd No eliminará los archivos originales y omitirá el mensaje de confirmación

source: Here are some examples:
es: Aquí hay algunos ejemplos:

# Examples
source: "Super QOI converter" C:\Absolute\path\to\your\image.png "Super QOI converter" F:\Several\paths.jpg C:\At\the\same\time.bmp "Super QOI converter" C:\With\options.tif -c -d
es: "Super QOI converter" C:\Ruta\absoluta\a\tu\imagen.png "Super QOI converter" F:\Varias\rutas.jpg C:\Al\mismo\tiempo.bmp "Super QOI converter" C:\Con\opciones.tif -c -d

# Contradictory options error
source: The program received contradictory options (-c and -nc or -d and -nd at the same time). Delete one of those options and try again
es: El programa recibió opciones contradictorias (-c y -nc o -d y -nd al mismo tiempo). Elimina una de esas opciones e inténtalo de nuevo

source: Yes
es: Sí

source: Yes to all
es: Sí a todo

source: No to all
es: No a todo

source: Exit
es: Salir

# Reading invalid path message
source: It isn't a valid path, skipping...
es: No es una ruta válida, omitiendo...

# You did not add any path
source: It looks like you didn't write any path, so the program will read them now
es: Parece que no escribiste ninguna ruta, así que el programa las leerá ahora

# Write your paths now
source: Write your absolute paths now, one per line. Write "Exit" to continue:
es: Escribe tus rutas absolutas ahora, una por línea. Escribe "Salir" para continuar:

source: Add at least one path
es: Añade por lo menos una ruta

# Already entered
source: This path has already been entered, skipping...
es: Esta ruta ya ha sido ingresada, omitiendo...

# Repo official link message
source: Repository official link
es: Enlace oficial del repositorio

source: made by
es: hecho por

# Use arrows or numbers and Enter
source: Use arrows or numbers to select option and press Enter
es: Usa las flechas o los números para seleccionar una opción y pulsa Enter

# Do not overwrite option
source: -no Won't overwrite files and skip confirmation
es: -no No sobrescribirá archivos y omitirá la confirmación

# Overwrite option
source: -o Overwrite files if they already exist
es: -o Sobrescribe los archivos si ya existen

# File already exists
source: File already exists. Overwrite?
es: El archivo ya existe. ¿Sobrescribir?

# Do you want to copy file info
source: Do you want to copy attributes and dates (creation and modification date) from the original file?
es: ¿Quieres copiar los atributos y fechas (fecha de creación y modificación) del archivo original?

# This is going to delete permanently
source: WARNING: This is going to delete the file PERMANENTLY. Won't move it to trash bin
es: ADVERTENCIA: Esto eliminará el archivo PERMANENTEMENTE. No lo moverá a la papelera de reciclaje

# Do you want to delete original file
source: Do you want to delete the original file?
es: ¿Quieres eliminar el archivo original?

# Thank you
source: Thank you for use Super QOI converter!
es: ¡Gracias por usar Super QOI converter!

# It looks like a directory
source: It looks like {0} is a directory. Do you want to read each image from it?
es: Parece que {0} es una carpeta. ¿Quieres leer cada imagen de ella?

# Not image or folder
source: This isn't a folder, image or it's not supported, skipping...
es: Esto no es una carpeta, imagen o no está soportada, omitiendo...

source: under a MIT license
es: con una licencia del MIT

# Version option
source: -v, --version Shows the version of the program
es: -v, --version Muestra la versión del programa

source: With help of:
es: Con ayuda de:
